#  Прямой лексический анализатор (Вариант 1)

Консольная программа на C++ для лексического анализа языка программирования в стиле Паскаль.

Программа читает исходный файл, разбивает его на лексемы (токены) и выводит результат с указанием типа лексемы, её значения и позиции в тексте.
---

## Возможности

* Распознавание 16 операторов и разделителей (+, -, *, /, mod, :=, ;, <>, <, >, <=, >=, =, {, begin, end)
* Поддержка 15 ключевых слов (vector, of, integer, real, goto, read, write, skip, space, tab, if, then, else, while, do)
* Обработка 5 форматов чисел:
Двоичные (0b1010, 0B1010)
Восьмеричные (0755)
Десятичные (123)
Шестнадцатеричные (0xFF, 0x1A)
Действительные (123.456, .123, 1.23e-4)
* Комментарии в стиле Паскаля { ... }
* Поддержка меток (label:)
* Регистрозависимый режим (идентификаторы Var и var различны)
* Подробный вывод с указанием строки и колонки
* Обработка синтаксических ошибок

---

## Требования

* Компилятор с поддержкой C++98 и выше
* Рекомендуется: g++ (Linux/macOS) или MS Visual C++ 6.0+ (Windows)

---

## Компиляция

macOS:

```bash
g++ -o DIR_SCAN MAIN.cpp SCANER.cpp TESTOUT.cpp error.cpp -I.
```

---

## Формат входного файла

Исходный файл может содержать любой корректный код на языке, близком к Паскалю:

```
begin
    x := 42;
    y := 0b1010;           { двоичное число }
    z := 0xFF;             { шестнадцатеричное }
    pi := 3.14159;         { действительное }
    
    if x > y then
        write(x);
        
    { это комментарий }
    
    while x > 0 do
        x := x - 1;
end.
```

