#ifndef __scaner_ext__
#define __scaner_ext__

/*
Хранит: прототипы функций, доступных извне

Что внутри:
- nxl() — главная функция "взять следующую лексему"
- extern lc, lv, unum, dnum, line, column, infil

НЕ ТРОГАТЬ
*/

#include "scaner_type.h"

//------------------------------------------------------------------------------

void nxl(void); 

//------------------------------------------------------------------------------

extern lc_type     lc;
extern char  lv[]; 

//------------------------------------------------------------------------------

extern unsigned  unum; 
extern double    dnum; 

//------------------------------------------------------------------------------

extern int line,    
           column;  

//------------------------------------------------------------------------------

extern FILE  *infil;

//------------------------------------------------------------------------------

#endif
