#ifndef __scaner_data__
#define __scaner_data__

//------------------------------------------------------------------------------
// scaner_ext.h - описания общих данных, используемых сканером
//------------------------------------------------------------------------------

#include "scaner_type.h"

//------------------------------------------------------------------------------

int const buf_size = 256; // размер буфера под значение лексемы

//------------------------------------------------------------------------------

static int   si;           // читаемый символ

//------------------------------------------------------------------------------

lc_type     lc;     // класс лексемы

char  lv[buf_size]; // значение лексемы
static int i_lv;           // текущая позиция при наборе лексемы

//------------------------------------------------------------------------------

unsigned  unum;     // двоичное представление для целого
double    dnum;     // двоичное представление для действительного

//------------------------------------------------------------------------------

int line,     // номер текущей строки
    column;   // позиция в текущей строке

//------------------------------------------------------------------------------

FILE    *infil;

#endif